fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СпискиДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализацмя</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
// @strict-types

#Область ОбработчикиКомандыФормы

&НаКлиенте
Процедура Заполнить(Команда)

	СоздатьРеализацию = Ложь;
ДлительнаяОперация = ВыполнениеНаСервере(СоздатьРеализацию);
ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацию(Команда)

	СоздатьРеализацию = Истина;

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;

	ДлительнаяОперация = ВыполнениеНаСервере(СоздатьРеализацию);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);


КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаСервере
Функция ВыполнениеНаСервере(СоздатьРеализацию)
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"Обработка.ВКМ_МассовоеСозданиеАктов.СозданиеСпискаНаСервере", Объект.Период, СоздатьРеализацию);
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = "Выполнено" Тогда
		МассивРеализаций = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ЗаполнитьДоговоры(МассивРеализаций);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговоры(МассивРеализаций)

	Объект.СпискиДоговоров.Очистить();

	Для Каждого Документ Из МассивРеализаций Цикл
		НоваяСтраница = Объект.СпискиДоговоров.Добавить();
		НоваяСтраница.Договор = Документ.Договор;
		НоваяСтраница.ДокументРеализацмя = Документ.Реализация;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
